{
  "artist": [
    {
      "name": "TIF",
      "avatar": "https://e-cdns-images.dzcdn.net/images/artist/61ab02f55194e2a323e16740db7fc2e5/1000x1000-000000-80-0-0.jpg",
      "biography": "Toufik alias TIF est un artiste originaire d’Alger résidant à Paris. Après le succès en 2019 de son premier titre « 3iniya » (« Mes yeux »), il crée son propre label HSH et, en Mai 2022, sort son premier projet auto-produit intitulé « Houma Sweet Houma » (« Quartier, mon doux quartier »). Son parcours est raconté par le média YARD dans un documentaire « On The Corner » réalisé par Samir Bouadla."
    },
    {
      "name": "Eminem",
      "avatar": "https://e-cdns-images.dzcdn.net/images/artist/19cc38f9d69b352f718782e7a22f9c32/1000x1000-000000-80-0-0.jpg",
      "biography": "Né à St. Joseph (Missouri) le 17 octobre 1972, abandonné par son père Marshall Bruce Mathers II, Marshall 3ème du nom passe son enfance entre sa ville natale et Warren, une banlieue sordide de Détroit. Il se lie rapidement d'amitié avec Proof, membre fondateur du collectif de rappeurs D12. Dans des quartiers où il est bien souvent le seul blanc et uniquement armé de sa bouche pour répondre aux agressions auxquelles il doit régulièrement faire face, il arrive bientôt à canaliser sa violence intérieure avec les mots."
    },
    {
      "name": "Népal",
      "avatar": "https://e-cdns-images.dzcdn.net/images/artist/d985eaeb702a8ddf8ca83f928ed36c0b/1000x1000-000000-80-0-0.jpg",
      "biography": "Népal, rappeur et beatmaker membre de la 75e session est aussi connu sous le nom de KLM ou Grandmaster Splinter. Son talent lui permet de multiplier les collaborations : Nekfeu, Di-Meh, Lomepal, Doums, Gracy Hopkins…. À travers sa musique, le jeune artiste rappe entre autres sur ses errances de Paris à Tokyo, jusqu’à ne plus différencier le vrai du faux. Il y développe une ambiance mélancolique et éthérée. Pour la première fois, il fera son entrée sur les plateformes de streaming le 23 août prochain, avec « 2016 – 2018 », une compilation de 14 morceaux issus de ses projets précédents, en attendant son nouvel LP à paraître à l’automne."
    },
    {
      "name": "Landy",
      "avatar": "https://e-cdns-images.dzcdn.net/images/artist/52dc90329c31988959fafb78f72171ce/1000x1000-000000-80-0-0.jpg",
      "biography": "Landy est un rappeur instinctif. De ceux pour qui la musique est une nécessité, presque un devoir. Avec son nouvel album, Brave, il conte son besoin vital de réussite et ce qu’il faut sacrifier pour y parvenir. Il le dit sans détour : « Sans le rap, je serais mort ou en prison. » Voilà ce qui procure à cet album une authenticité évidente et un aspect brut. Landy sait faire des tubes : il l’a prouvé dès son entrée dans le game en 2017 avec le single « En bas de chez moi » ou avec « Muerte » en 2019, entre bien d’autres. Mais il sait aussi raconter la rue, son environnement, dans ce qu’il a de plus dur et de plus précieux. C’est pourquoi cet album s’accompagne d’une série autobiographique en trois épisodes réalisée par Anouar El Alami. Elle commence par cette phrase : « Je m’appelle Dylan, mais comme tu le sais, au quartier on m’appelle Landy. » Deux facettes de sa personnalité s’y dévoilent, l’une qui tente d’éviter les embûches et les embrouilles dans son Saint-Denis natal, l’autre qui l’en sort grâce à la musique. Révélé au grand public il y a maintenant cinq ans, Landy s’est définitivement fait un nom dans le rap français grâce à son premier album certifié or Assa Baing en 2019, confirmé par le succès plus grand encore d’A-One un an plus tard, certifié platine. Il y faisait déjà parler ses aptitudes de story-teller, comme sur l’énorme carton « Médusa », et collaborait avec des noms fameux tels que Niska, Soolking, Koba LaD ou Jul, preuve que les poids lourds cherchent eux aussi à se frotter à lui. Sur son nouvel album Brave, il parfait sa science de la mélodie et construit une ode à la détermination, valeur indispensable pour qui veut durer dans le rap. Il s’inspire des rythmiques africaines qui ont bercé son enfance, ivoiriennes ou congolaises, à l’image du titre « Auto-détruit », et les marie aux productions chapeautées par le fidèle DJ Bellek, architecte de certains de ses plus gros succès. Cette fois, d’autres noms retentissants l’accompagnent : Gazo sur le titre frontal « Maybach », Leto et Rsko sur le ténébreux « Chaque jour », Ronisia sur le langoureux « Mental »… Tous participent à donner à Brave une esthétique résolument rap et directe. Quand Landy ne se décline pas en mélodies, il rappelle qu’il est avant tout un rappeur qui dépeint les murs et leurs couleurs, comme sur le morceau « Né pour briller ». D’une traite, sans artifice, il y explore la mélancolie d’une vie pas si lointaine, celle qu’il a menée dans son quartier de Joliot-Curie et dont il s’extirpe sans s’en détacher totalement. Landy ne peut pas renier son passé, alors il l’exprime. Le succès, les featurings prestigieux et la réussite peuvent le faire briller, rien ne lui fera oublier d’où il vient."
    },
    {
      "name": "The Chainsmokers",
      "avatar": "https://e-cdns-images.dzcdn.net/images/artist/df6be3970a5d859380178c003c656141/1000x1000-000000-80-0-0.jpg",
      "biography": "Tous deux étudiants à New York, Andrew Taggart et Alex Pall unissent leurs forces musicales en 2012 pour former le duo The Chainsmokers. A peine mis en route, il réalise un premier coup d'éclat avec le single « Erase » où la star indienne Priyanka Chopra tient les vocaux. The Chainsmokers est d'abord surtout actif dans le domaine des remixes où il se frotte à toutes les rendances de l'electro ainsi qu'au rock et à la pop. Tour à tour des artistes comme Dragonette, Say Lou Lou, The Killers, Phoenik, BANKS ou Ellie Goulding font appel à son talent en ce domaine."
    },
    {
      "name": "Yellow Claw",
      "avatar": "https://e-cdns-images.dzcdn.net/images/artist//1000x1000-000000-80-0-0.jpg",
      "biography": "Dutch record producers and DJs Jim Aasgier and Nils Ronhuis, who goes by the name Nizzle, have attained international attention as Yellow Claw, releasing their own albums and singles with various artists. After starting out in Amsterdam, they began performing at festivals across Europe, released tracks and videos and two EPs, 'Amsterdam Trap Music' and 'Amsterdam Twerk Music'. A third EP, 'Amsterdam Trap Music, Vol. 2', went to number 20 on Billboard's Top Dance/Electronic Albums Chart in 2014. They collaborated on singles with artists such as Star-i, DJ Snake, Krewella, Taylor Bennett, Ayden, Steve Aoki, Gucci Mane, T-Pain, Yade Lauren, San Holo, Moksi, Joanna Fraser, Elliphant and Flosstradamus and 'In My Room' with DJ Mustard featuring Ty Dolla $ign & Tyga went to number 12 on Billboard's Hot Dance/Electronic Songs Chart. Their debut full album 'Blood for Mercy' topped the Dance/Electronic Albums Chart, 'Los Amsterdam' (2017) went to number three and 'New Blood' (2018) peaked at number seven."
    },
    {
      "name": "Axwell /\\ Ingrosso",
      "avatar": "https://e-cdns-images.dzcdn.net/images/artist/f062b593c5913988424eb53344da5f0d/1000x1000-000000-80-0-0.jpg",
      "biography": "Axwell /\\ Ingrosso (pour Axwell and Ingrosso) est la suite donnée par les deux DJ suédois à Swedish House Mafia. Après la séparation du trio à l'issue du One Last Tour en 2013, Steve Angello part de son côté alors que Axwell et Sebastian Ingrosso décident de continuer ensemble. Malgré la notoriété de leurs deux noms accolés, le premier single d'Axwell /\\ Ingrosso « Can't Hold Us Down » n'est pas un succès majeur. Il en va différemment de « Something New » sorti en novembre 2014 qui devient un tube planétaire début 2015."
    },
    {
      "name": "Keyzo",
      "avatar": "https://e-cdns-images.dzcdn.net/images/artist/d25a7dc834681abfbb6ae15b6cd83567/1000x1000-000000-80-0-0.jpg",
      "biography": ""
    },
    {
      "name": "Georgio",
      "avatar": "https://e-cdns-images.dzcdn.net/images/artist/024ca45e4a05e40e1f4eb8db552d4023/1000x1000-000000-80-0-0.jpg",
      "biography": "Georges dit Georgio né à Paris en 1993, est issu du quartier Max Dormoy dans le dix-huitième arrondissement. Il se fait la voix sur ses premières rimes en 2007 et décide deux ans plus tard de se consacrer au rap. "
    },
    {
      "name": "PRIME",
      "avatar": "https://e-cdns-images.dzcdn.net/images/artist/5135073084a95d30c3075a3c4e5c0e14/1000x1000-000000-80-0-0.jpg",
      "biography": "S’il fait grand bruit dans le milieu du rap à 27 ans avec un premier album remarqué, Xander, Prime (de son vrai nom Amine Mekri, et de son précédent alias PrimeTimeFUT), est avant tout une star de YouTube, spécialiste des jeux vidéos. Devenu une figure des réseaux sociaux, avec pas moins d’1,6 millions d’abonnés, il se diversifie et investit le domaine des vlogs et du rap. Il aurait tout aussi bien pu devenir joueur de football américain, pratiquant à La Courneuve avant d’intégrer l’équipe de France Junior et de s’envoler pour le Canada. Mais une grave blessure en 2012, alors qu’il n’a que vingt ans, anéantit ses rêves de NFL. Finalement, le destin lui sourit quand sa carrière de rappeur prend un tour sérieux avec des premiers pas sur les planches du Bataclan en 2017 et l’Olympia en 2019. L’année suivante, Prime est donc de retour avec le projet Xander, qui compte sept nouveaux titres, dont « J’aime pas l’amour » ou « Vitesse ». "
    },
    {
      "name": "Jul",
      "avatar": "https://e-cdns-images.dzcdn.net/images/artist/138cc2a75ea276b78ac9f60a36fb566c/1000x1000-000000-80-0-0.jpg",
      "biography": "Jul est né le 14 janvier 1990 dans le quartier Saint-Jean du Désert à Marseille (Bouches-du-Rhône). Ce jeune artiste réalise depuis 2014 l’exploit de passer du rap home made à la lumière des meilleures ventes du top albums. En 2014, Jul est surtout connu localement via internet puis explose plus largement avec la sortie de son 1er album « Dans ma Paranoïa » dont le succès commercial s’annonce dès la 1ere semaine. Sur les plateformes de streaming, les clips de ses chansons cumulent des millions de vues et il comptabilise aujourd’hui plus de 8 millions d’abonnés sur l’ensemble de ses réseaux. Un intérêt massif provoqué par un rap nouvelle génération, terriblement efficace, marqué par un style unique et audacieux. Nombre de singles récoltent les honneurs du classement par titres tandis que d’autres se positionnent naturellement dans les charts. Jul s’impose en tant qu’artiste incontournable de la scène urbaine francophone et collectionne les certifications or,platine,diamant. À la fois icône d’un public éclectique composé d’hommes et de femmes de tout âge, et icône de toute une génération rap, Jul est désormais un artiste historique dans le paysage musical francophone. Il est l’auteur de plusieurs symboles déjà cultes pour toute une génération. En 2019, il sort son 19ème album « C’est pas des LoL » certifié disque de platine en moins de deux mois. En 2020, Jul gagne le trône du plus gros vendeur de l’histoire du rap français avec 4 millions d’albums vendus depuis le début de sa carrière. Il ne prévoit pas de diminuer son rythme de productivité hors normes et annonce déjà un concert évènementiel complet au Stade Vélodrome."
    },
    {
      "name": "Beyoncé",
      "avatar": "https://e-cdns-images.dzcdn.net/images/artist/2de869b50d9f5cf7f1a673d0b736c4a0/1000x1000-000000-80-0-0.jpg",
      "biography": "Ayant atteint les sommets des charts au sein du quatuor Destiny's Child entre 1990 et 2006, Beyoncé Knowles (née à Houston, Texas, le 4 septembre 1981) s'est imposée par la suite en solo comme l'une des figures les plus populaires de la fusion R&B, pop, rap et soul. Son premier album solo Dangerously in Love (2003), qui comprend le tube « Crazy in Love », son premier numéro un (elle en comptera onze en vingt ans de carrière), lui apporte d'emblée la reconnaissance mondiale. Les albums suivants obtiennent le même succès : B'Day (2006) et I Am...Sasha Fierce (2008) se classent numéro un aux États-Unis tandis que leurs extraits publiés en simples s'inscrivent dans les hit-parades du monde entier. Mariée au rappeur multimillionnaire Jay-Z en 2010, Beyoncé retrouve dans l'album 4 (n°1 en 2011) la soul et le funk de ses débuts. En décembre 2013, la star du R&B prend le monde par surprise avec la sortie de Beyoncé (n°1), qui était restée secrète. Il en est de même pour l'album suivant Lemonade (n°1 en 2016), dont les chansons sont illustrées dans un DVD. Beyoncé est bientôt de retour sur un nouveau terrain : le cinéma, puisqu'elle est annoncée à l'affiche du remake du Roi Lion par les studios Disney, dans lequel elle prête sa voix au personnage de Nala. Par ailleurs, la chanteuse signe un contrat de 60 millions de dollars avec Netflix, qui publie un documentaire exclusif, Homecoming, assorti d'un live éponyme. En juillet, elle peut enfin dévoiler le résultat de son travail sur la bande originale du remake du Roi Lion, avec un premier extrait aux accents soul, « Spirit ». Baptisé The Lion King : The Gift, il bénéficie du concours de Childish Gambino, Jay Z, Major Lazer ou encore Kendrick Lamar. En 2020, elle prolonge le projet avec un film musical, écrit et réalisé par Beyoncé à partir de la bande originale précédente : Black is King, qui chante la richesse de l'identité noire. La chanteuse revient en 2022 avec Renaissance (n°1 aux États-Unis), un album inspiré par le disco, la dance et la house, auquel contribuent, parmi de très nombreux intervenants, Skrillex, Grace Jones, Raphael Saadiq ou encore Nile Rodgers."
    },
    {
      "name": "Kaaris",
      "avatar": "https://e-cdns-images.dzcdn.net/images/artist/62634ba241b634658eea2c46429b9253/1000x1000-000000-80-0-0.jpg",
      "biography": "Né à Sevran, en Seine-Saint-Denis, le 30 janvier 1980, Gnakouri Okou alias Kaaris grandit dans ce département réputé pour son rap dur sans concession (NTM, Assassin, etc). Il débute son parcours en 1999 au sein du collectif Niroshima et multiplie les apparitions, en particulier sur des mixtapes signées Cut Killer ou Poska. En 2003, le jeune rappeur part en Côte d'Ivoire sur les traces de ses ancêtres, se retrouvant en pleine guerre civile. Revenu en France, il sort en 2006 le street album 43ème Bima. Rappeur de style hardcore, Kaaris se retrouve dans l'entourage de l'aîné Booba. C'est ainsi qu'en 2011 il figure sur la mixtape Autopsie, Vol. 4 de ce dernier, avant de se trouver au coeur d'une polémique médiatisée entre Booba et La Fouine. Kaaris en profite pour placer son single « Zoo », aussitôt classé dans les meilleures ventes de singles en mars 2013. Sortent alors une rafale de titres qui parviennent tous à intégrer le classement français, dont le plus significatif reste « Dès le départ » entré dans les cinquante premières places en septembre."
    }
  ],
  "album": [
    {
      "name": "1.6",
      "cover": "https://e-cdns-images.dzcdn.net/images/cover/6337e63671aff4bcc84abab7318de0a7/1000x1000-000000-80-0-0.jpg",
      "release_date": "03/11/2023",
      "artist_id": 1
    },
    {
      "name": "The Eminem Show",
      "cover": "https://e-cdns-images.dzcdn.net/images/cover/ec3c8ed67427064c70f67e5815b74cef/1000x1000-000000-80-0-0.jpg",
      "release_date": "01/01/2002",
      "artist_id": 2
    },
    {
      "name": "Adios Bahamas",
      "cover": "https://e-cdns-images.dzcdn.net/images/cover/ca7a7ec518e3f151b04a36ed53dc2919/1000x1000-000000-80-0-0.jpg",
      "release_date": "10/01/2020",
      "artist_id": 3
    },
    {
      "name": "A-One",
      "cover": "https://e-cdns-images.dzcdn.net/images/cover/21782f5736e21bc6892f4467f0ebf677/1000x1000-000000-80-0-0.jpg",
      "release_date": "18/12/2020",
      "artist_id": 4
    },
    {
      "name": "Memories...Do Not Open",
      "cover": "https://e-cdns-images.dzcdn.net/images/cover/d4451405fea03536f6788fa806045141/1000x1000-000000-80-0-0.jpg",
      "release_date": "07/04/2017",
      "artist_id": 5
    },
    {
      "name": "Los Amsterdam",
      "cover": "https://e-cdns-images.dzcdn.net/images/cover/05fdc00c605058079b3015d45ce02c68/1000x1000-000000-80-0-0.jpg",
      "release_date": "",
      "artist_id": 6
    },
    {
      "name": "More Than You Know",
      "cover": "https://e-cdns-images.dzcdn.net/images/cover/0cd51b420e95f4d0410a03bbf7053119/1000x1000-000000-80-0-0.jpg",
      "release_date": "31/03/2017",
      "artist_id": 7
    },
    {
      "name": "Key Zoo",
      "cover": "https://e-cdns-images.dzcdn.net/images/cover/e868d90dd41ff27a55e0ba1718121294/1000x1000-000000-80-0-0.jpg",
      "release_date": "12/12/2019",
      "artist_id": 8
    },
    {
      "name": "Ciel enflammé - Sacré",
      "cover": "https://e-cdns-images.dzcdn.net/images/cover/d6cef00e9233fa0109a6aca307b00215/1000x1000-000000-80-0-0.jpg",
      "release_date": "07/05/2021",
      "artist_id": 9
    },
    {
      "name": "RE.",
      "cover": "https://e-cdns-images.dzcdn.net/images/cover/146893f4c8235955aedb3f8c3e81218c/1000x1000-000000-80-0-0.jpg",
      "release_date": "15/06/2022",
      "artist_id": 10
    },
    {
      "name": "La route est longue",
      "cover": "https://e-cdns-images.dzcdn.net/images/cover/fc33741d7550376db66a19dfcdb5fa0b/1000x1000-000000-80-0-0.jpg",
      "release_date": "08/12/2023",
      "artist_id": 11
    },
    {
      "name": "RENAISSANCE",
      "cover": "https://e-cdns-images.dzcdn.net/images/cover/c3e2a951678a28a3f541a69c866583d4/1000x1000-000000-80-0-0.jpg",
      "release_date": "29/07/2022",
      "artist_id": 12
    },
    {
      "name": "Or Noir",
      "cover": "https://e-cdns-images.dzcdn.net/images/cover/1592d2a42e992da187cb70f12994677d/1000x1000-000000-80-0-0.jpg",
      "release_date": "01/01/2013",
      "artist_id": 13
    }
  ],
  "genres": [
    {
      "name": "Hip-Hop",
      "description": "Le hip-hop est un genre musical caractérisé par le rythme, le discours rythmé (rap) et la rhétorique. Il englobe une culture variée comprenant le rap, le scratching, le breakdance et le graffiti."
    },
    {
      "name": "Rap",
      "description": "Le rap est un style musical et une forme d'expression culturelle associée au hip-hop. Il se caractérise par le discours rythmé et le flow des paroles, souvent accompagnés de beats musicaux."
    },
    {
      "name": "Electro",
      "description": "La musique électronique, souvent abrégée en electro, est un genre musical qui utilise des instruments électroniques et des technologies de production sonore pour créer des compositions musicales."
    },
    {
      "name": "Trap",
      "description": "La trap est un sous-genre du hip-hop caractérisé par des basses lourdes, des hi-hats trépidants et des échantillons sonores. Elle a évolué à partir du southern hip-hop et de la musique électronique."
    },
    {
      "name": "Electronic Dance Music",
      "description": "La musique électronique dansante, ou EDM, est un terme générique englobant divers genres de musique électronique conçus pour la danse. Cela inclut la house, la techno, la trance, la dubstep, et d'autres."
    },
    {
      "name": "House",
      "description": "La house est un genre de musique électronique caractérisé par des rythmes de danse, des mélodies répétitives et l'utilisation de synthétiseurs. Elle est souvent associée à la scène de clubbing."
    },
    {
      "name": "R&B",
      "description": "Le R&B, ou rhythm and blues, est un genre musical qui mélange des éléments de blues, de soul, de funk et de hip-hop. Il se caractérise par des mélodies mélancoliques et des thèmes romantiques."
    },
    {
      "name": "Pop",
      "description": "La pop, ou musique populaire, est un genre musical accessible et souvent mélodique qui vise un large public. Elle peut incorporer divers éléments d'autres genres et évoluer au fil du temps."
    }
  ],
  "song": [
    {
      "title": "Demain c'est b3id",
      "duration": "190",
      "artist_id": 1,
      "album_id": 1,
      "genres": [1]
    },
    {
      "title": "Without me",
      "duration": "290",
      "artist_id": 2,
      "album_id": 2,
      "genres" : [1,2]
    },
    {
      "title": "Sundance",
      "duration": "170",
      "artist_id": 3,
      "album_id": 3,
      "genres" : [1,2]
    },
    {
      "title": "Médusa",
      "duration": "157",
      "artist_id": 4,
      "album_id": 4,
      "genres" : [1,2]
    },
    {
      "title": "Something Just Like This",
      "duration": "247",
      "artist_id": 5,
      "album_id": 5,
      "genres" : [3,4]
    },
    {
      "title": "Last Paradise",
      "duration": "163",
      "artist_id": 6,
      "album_id": 6,
      "genres" : [3,4,5]
    },
    {
      "title": "More Than You Know",
      "duration": "203",
      "artist_id": 7,
      "album_id": 7,
      "genres" : [3,6]
    },
    {
      "title": "Agesicoye",
      "duration": "188",
      "artist_id": 8,
      "album_id": 8,
      "genres" : [1]
    },
    {
      "title": "Concept flou",
      "duration": "218",
      "artist_id": 9,
      "album_id": 9,
      "genres" : [1,2]
    },
    {
      "title": "TERRE ENTIERE",
      "duration": "166",
      "artist_id": 10,
      "album_id": 10,
      "genres" : [1,2]
    },
    {
      "title": "Sensations",
      "duration": "261",
      "artist_id": 11,
      "album_id": 11,
      "genres" : [1,2]
    },
    {
      "title": "Energy",
      "duration": "117",
      "artist_id": 12,
      "album_id": 12,
      "genres" : [7,8]
    },
    {
      "title": "Zoo",
      "duration": "288",
      "artist_id": 13,
      "album_id": 13,
      "genres" : [1,2]
    }
  ],
  "user": [
    {
      "name": "Rap91",
      "email": "victor.martin@rap91.fr",
      "password": "ILoveRap91"
    },
    {
      "name": "CountryBoy",
      "email": "gerard.country@fictif.fr",
      "password": "CountryVIE456"
    },
    {
      "name": "PoliceMan",
      "email": "lucas.adrien@gogole.fr",
      "password": "POLICEman123"
    }
  ]
}
